<?php

return [
    '_base' => [
        'default'     => 'به نظر می رسد مشکلی پیش آمده است.',
        'throttle'    => 'تلاش های خیلی زیاد!',
        'bad_request' => 'درخواست شما نامعتبر است. لطفاً درخواست خود را بررسی کنید و دوباره امتحان کنید.',
        'forbidden'   => 'شما مجاز به انجام این درخواست نیستید.',
        'not_found'   => [
            'route' => 'مسیر (route) مورد نظر یافت نشد.',
            'item'  => [
                'default'  => 'آیتم مورد نظر یافت نشد.',
                'variable' => ':item مورد نظر یافت نشد.'
            ]
        ],
        'unauthorized' => 'شما برای دسترسی به این منبع مجوز لازم را ندارید.',
        'validation'   => 'خطایی در ارزیابی داده های ورودی رخ داده است.',
    ],

    'form' => [
        'not_found' => 'ثبت فرم با خطا مواجه شد.',
    ],

    'operator' => [
        'not_found' => 'اپراتور مورد نظر یافت نشد.',
    ],
];
